// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   PciStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell pci command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_PCI2_OUT_RESOURCES         #language eng  "%Hpci:%N Out of resources\n"

#string STR_PCI2_LOCATE_HANDLE         #language eng  "%Hpci:%N Locate handle error - %r\n"

#string STR_PCI2_HANDLE_PROTOCOL       #language eng  "%Hpci:%N Handle protocol or configuration error - %r\n"

#string STR_PCI2_BUS                   #language eng  "%Hpci:%N Get next bus range error - %r\n"

#string STR_PCI2_SEG_BUS               #language eng  "   Seg  Bus  Dev  Func\n"

#string STR_PCI2_FOUR_VARS             #language eng  "    %E%02x   %02x   %02x    %02x ==> %N"

#string STR_PCI2_VENDOR                #language eng  "\n             Vendor %04x Device %04x Prog Interface %x\n"

#string STR_PCI2_TOO_FEW_ARGS          #language eng  "%Hpci:%N Too few arguments\n"

#string STR_PCI2_TOO_MANY_ARGS         #language eng  "%Hpci:%N Too many arguments\n"

#string STR_PCI2_TOO_MANY_ARGS_EXCEPT  #language eng  "%Hpci:%N Too many arguments except \"-i\"\"-s\"\n"

#string STR_PCI2_TOO_FEW_ARGS_EXCEPT   #language eng  "%Hpci:%N Too few arguments except \"-i\", \"-s\"\n"

#string STR_PCI2_CANNOT_FIND_PROTOCOL  #language eng  "%Hpci:%N Cannot find protocol interface for segment %hd, bus %hd\n"

#string STR_PCI2_CANNOT_READ_CONFIG    #language eng  "%Hpci:%N Cannot read configuration data - %r\n"

#string STR_PCI2_SEGMENT_BUS           #language eng  "%H  PCI Segment %02x Bus %02x Device %02x Func %02x%N [EFI %02x%02x%02x%02x00]\n"

#string STR_PCI2_VENDOR_ID             #language eng  "Vendor ID(%x): %E%04x%N                     "

#string STR_PCI2_DEVICE_ID             #language eng  "Device ID(%x): %E%04x%N\n\n"

#string STR_PCI2_REVISION_ID           #language eng  "\nRevision ID(%x):     %E%02x%N                 "

#string STR_PCI2_BIST                  #language eng  "BIST(%02x): "

#string STR_PCI2_CAPABLE_RETURN        #language eng  "Capable,Return: %E%02x%N\n"

#string STR_PCI2_INCAPABLE             #language eng  " Incapable\n"

#string STR_PCI2_CACHE_LINE_SIZE       #language eng  "Cache Line Size(%x): %E%02x%N                 "

#string STR_PCI2_LATENCY_TIMER         #language eng  "Latency Timer(%x): %E%02x%N\n"

#string STR_PCI2_HEADER_TYPE           #language eng  "Header Type(%02x):    %E%02x%N, "

#string STR_PCI2_MULTI_FUNCTION        #language eng  "Multi-function, "

#string STR_PCI2_SINGLE_FUNCTION       #language eng  "Single function, "

#string STR_PCI2_PCI_DEVICE            #language eng  "PCI device\n"

#string STR_PCI2_P2P_BRIDGE            #language eng  "P2P bridge\n"

#string STR_PCI2_CARDBUS_BRIDGE        #language eng  "CardBus bridge\n"

#string STR_PCI2_RESERVED              #language eng  "Reserved\n"

#string STR_PCI2_CLASS                 #language eng  "Class: "

#string STR_PCI2_BASE_ADDR             #language eng  "Base Address Registers(%x):\n"

#string STR_PCI2_START_TYPE            #language eng  "     Start_Address  Type  Space    Prefetchable?     Size             Limit\n"

#string STR_PCI2_NONE                  #language eng  "  (None)"

#string STR_PCI2_EXPANSION_ROM_DISABLED #language eng  "\nExpansion ROM Disabled(%x)\n\n"

#string STR_PCI2_EXPANSION_ROM_BASE    #language eng  "\nExpansion ROM Base Address(%x): %E%08x%N\n\n"

#string STR_PCI2_CARDBUS_CIS           #language eng  "Cardbus CIS ptr(%x):   %E%08x%N\n"

#string STR_PCI2_SUB_VENDOR_ID         #language eng  "Sub VendorID(%x):          %E%04x%N      "

#string STR_PCI2_SUBSYSTEM_ID          #language eng  "Subsystem ID(%x):      %E%04x%N\n"

#string STR_PCI2_CAPABILITIES_PTR      #language eng  "Capabilities Ptr(%x):        %E%02x%N\n"

#string STR_PCI2_INTERRUPT_LINE        #language eng  "Interrupt Line(%x):          %E%02x%N      "

#string STR_PCI2_INTERRUPT_PIN         #language eng  "Interrupt Pin(%x):       %E%02x%N\n"

#string STR_PCI2_MIN_GNT               #language eng  "Min_Gnt(%x):                 %E%02x%N      "

#string STR_PCI2_MAX_LAT               #language eng  "Max_Lat(%x):             %E%02x%N\n"

#string STR_PCI2_BASE_ADDRESS          #language eng  "Base Address Registers(%x):"

#string STR_PCI2_START_TYPE_2          #language eng  "     Start_Address  Type  Space    Prefetchable?     Size             Limit\n"

#string STR_PCI2_NO_EXPANSION_ROM      #language eng  "\nNo Expansion ROM(%x)    "

#string STR_PCI2_EXPANSION_ROM_BASE_2  #language eng  "\nExpansion ROM Base Address(%x): %E%08x%N\n"

#string STR_PCI2_BUS_NUMBERS           #language eng  "\n\n(Bus Numbers)  Primary(%x)     Secondary(%x)   Subordinate(%x)\n"

#string STR_PCI2_BRIDGE                #language eng  "               %E%02x%N"

#string STR_PCI2_SECONDARY_TIMER       #language eng  "\nSecondary Latency Timer(%x):       %E%02x%N\n\n"

#string STR_PCI2_RESOURCE_TYPE         #language eng  "\nResource Type                            Base                    Limit\n"

#string STR_PCI2_TWO_VARS              #language eng  "I/O(%x)                            %E%08x%N"

#string STR_PCI2_ONE_VAR               #language eng  "                 %E%08x%N\n"

#string STR_PCI2_MEMORY                #language eng  "Memory(%x)                         %E%08x%N"

#string STR_PCI2_PREFETCHABLE          #language eng  "Prefetchable Memory(%x)    %E%08x%08x%N"

#string STR_PCI2_TWO_VARS_2            #language eng  "         %E%08x%08x%N\n"

#string STR_PCI2_CAPABILITIES_PTR_2    #language eng  "\nCapabilities Ptr(%x):   %E%02x%N             \n\n"

#string STR_PCI2_INTERRUPT_LINE_2      #language eng  "\nInterrupt Line(%x)      %E%02x%N             "

#string STR_PCI2_BAR                   #language eng  "\n          %E%08x%N  "

#string STR_PCI2_MEM                   #language eng  "Mem   "

#string STR_PCI2_32_BITS               #language eng  "32 bits  "

#string STR_PCI2_ONE_VAR_2             #language eng  "\n  %E%08x"

#string STR_PCI2_ONE_VAR_3             #language eng  "%08x%N  "

#string STR_PCI2_64_BITS               #language eng  "64 bits  "

#string STR_PCI2_MEM_2                 #language eng  "Mem            "

#string STR_PCI2_NO                    #language eng  "No     "
             
#string STR_PCI2_YES                   #language eng  "YES    "
                   
#string STR_PCI2_ONE_VAR_4             #language eng  "\n              %E%04x%N  "
                                   
#string STR_PCI2_IO                    #language eng  "I/O                               "
                                     
#string STR_PCI2_NEWBAR_32             #language eng  "        %08x  "
                                    
#string STR_PCI2_NEWBAR_32_2           #language eng  "        %08x"
                                     
#string STR_PCI2_RSHIFT                #language eng  "%08x"
                                     
#string STR_PCI2_NEWBAR_32_3           #language eng  "%04x              "
                                    
#string STR_PCI2_NEWBAR_32_4           #language eng  "%04x"
                                       
#string STR_PCI2_CARDBUS_SOCKET        #language eng  "\nCardBus Socket Registers/ExCA Base Address Register(%x): %E%8x%N\n\n"

#string STR_PCI2_BUS_NUMBERS_2         #language eng  "\n(Bus Numbers)  Pci(%x)         CardBus(%x)     Subordinate(%x)\n"

#string STR_PCI2_CARDBUS               #language eng  "               %E%02x%N"

#string STR_PCI2_CARDBUS_2             #language eng  "                %E%02x%N"

#string STR_PCI2_CARDBUS_3             #language eng  "                %E%02x%N\n"

#string STR_PCI2_CARDBUS_LATENCY       #language eng  "\nCardBus Latency Timer(%x):         %E%02x%N\n"

#string STR_PCI2_RESOURCE_TYPE_2       #language eng  "\nResource Type              Type              Base                Limit\n"

#string STR_PCI2_MEM_3                 #language eng  "Mem(%x)      %s          %E%08x%N             %E%08x%N\n"

#string STR_PCI2_IO_2                  #language eng  "I/O(%x)      %s          %E%08x%N             %E%08x%N\n"

#string STR_PCI2_INTERRUPT_LINE_3      #language eng  "\nInterrupt Line(%x):     %E%02x%N             Interrupt Pin(%x):       %E%02x%N\n"

#string STR_PCI2_SUB_VENDOR_ID_2       #language eng  "\nSub VendorID(%x):     %E%04x%N             Subsystem ID(%x):      %E%04x%N\n"

#string STR_PCI2_OPTIONAL              #language eng  "Optional 16-Bit PC Card legacy Mode Base Address(%x): %E%08x%N\n"

#string STR_PCI2_STATUS                #language eng  "Status(%x): %E%04x%N\n"

#string STR_PCI2_SECONDARY_STATUS      #language eng  "Secondary Status(%2x): %E%4x%N\n"

#string STR_PCI2_NEW_CAPABILITIES      #language eng  "  (04)New Capabilities linked list:   %E%d%N"

#string STR_PCI2_66_CAPABLE            #language eng  "  (05)66MHz Capable:                %EN/A%N\n"

#string STR_PCI2_66_CAPABLE_2          #language eng  "  (05)66MHz Capable:                  %E%d%N\n"

#string STR_PCI2_FAST_BACK             #language eng  "  (07)Fast Back-to-Back Capable:      %E%d%N"

#string STR_PCI2_MASTER_DATA           #language eng  "  (08)Master Data Parity Error:       %E%d%N\n"

#string STR_PCI2_DEVSEL_TIMING         #language eng  "  (09)DEVSEL timing:           "

#string STR_PCI2_FAST                  #language eng  "%E    Fast%N"

#string STR_PCI2_MEDIUM                #language eng  "%E  Medium%N"

#string STR_PCI2_SLOW                  #language eng  "%E    Slow%N"

#string STR_PCI2_RESERVED_2            #language eng  "%EReserved%N"

#string STR_PCI2_SIGNALED_TARGET       #language eng  "  (11)Signaled Target Abort:          %E%d%N\n"

#string STR_PCI2_RECEIVED_TARGET       #language eng  "  (12)Received Target Abort:          %E%d%N"

#string STR_PCI2_RECEIVED_MASTER       #language eng  "  (13)Received Master Abort:          %E%d%N\n"

#string STR_PCI2_SIGNALED_ERROR        #language eng  "  (14)Signaled System Error:          %E%d%N"

#string STR_PCI2_RECEIVED_ERROR        #language eng  "  (14)Received System Error:          %E%d%N"

#string STR_PCI2_DETECTED_ERROR        #language eng  "  (15)Detected Parity Error:          %E%d%N\n"

#string STR_PCI2_COMMAND               #language eng  "Command(%x): %E%04x%N\n"

#string STR_PCI2_SPACE_ACCESS_DENIED   #language eng  "  (00)I/O space access enabled:       %E%d%N"

#string STR_PCI2_MEMORY_SPACE          #language eng  "  (01)Memory space access enabled:    %E%d%N\n"

#string STR_PCI2_BEHAVE_BUS_MASTER     #language eng  "  (02)Behave as bus master:           %E%d%N"

#string STR_PCI2_MONITOR_SPECIAL_CYCLE #language eng  "  (03)Monitor special cycle enabled:  %E%d%N\n"

#string STR_PCI2_MEM_WRITE_INVALIDATE  #language eng  "  (04)Mem Write & Invalidate enabled: %E%d%N"

#string STR_PCI2_PALETTE_SNOOPING      #language eng  "  (05)Palette snooping is enabled:    %E%d%N\n"

#string STR_PCI2_ASSERT_PERR           #language eng  "  (06)Assert PERR# when parity error: %E%d%N"

#string STR_PCI2_DO_ADDR_STEPPING      #language eng  "  (07)Do address/data stepping:       %E%d%N\n"

#string STR_PCI2_SERR_DRIVER           #language eng  "  (08)SERR# driver enabled:           %E%d%N"

#string STR_PCI2_FAST_BACK_2           #language eng  "  (09)Fast back-to-back transact...:  %E%d%N\n\n"

#string STR_PCI2_BRIDGE_CONTROL        #language eng  "Bridge Control(%x)     %E%04x%N\n"

#string STR_PCI2_PARITY_ERROR          #language eng  "  (00)Parity Error Response:          %E%d%N"

#string STR_PCI2_SERR_ENABLE           #language eng  "  (01)SERR# Enable:                   %E%d%N\n"

#string STR_PCI2_ISA_ENABLE            #language eng  "  (02)ISA Enable:                     %E%d%N"

#string STR_PCI2_VGA_ENABLE            #language eng  "  (03)VGA Enable:                     %E%d%N\n"

#string STR_PCI2_MASTER_ABORT          #language eng  "  (05)Master Abort Mode:              %E%d%N"

#string STR_PCI2_SECONDARY_BUS_RESET   #language eng  "  (06)Secondary Bus Reset:            %E%d%N\n"

#string STR_PCI2_FAST_ENABLE           #language eng  "  (07)Fast Back-to-Back Enable:       %E%d%N"

#string STR_PCI2_PRIMARY_DISCARD_TIMER #language eng  "  (08)Primary Discard Timer:       %E%s%N\n"

#string STR_PCI2_SECONDARY_DISCARD_TIMER #language eng  "  (09)Secondary Discard Timer:     %E%s%N"

#string STR_PCI2_DISCARD_TIMER_STATUS  #language eng  "  (10)Discard Timer Status:           %E%d%N\n"

#string STR_PCI2_DISCARD_TIMER_SERR    #language eng  "  (11)Discard Timer SERR# Enable:     %E%d%N\n"

#string STR_PCI2_CARDBUS_RESET         #language eng  "  (06)CardBus Reset:                  %E%d%N\n"

#string STR_PCI2_IREQ_ENABLE           #language eng  "  (07)IREQ/INT Enable:                %E%d%N"

#string STR_PCI2_WRITE_POSTING_ENABLE  #language eng  "  (10)Write Posting Enable:           %E%d%N\n"

#string STR_PCI_CLASS_THREE_VARS       #language eng  "%s - %s - %s"

#string STR_PCI_CLASS_ONE_VARS         #language eng  "%s"

#string STR_PCIEX_CAPABILITY_CAPID     #language eng  "  CapID(%2x):          %E%02x%N"

#string STR_PCIEX_NEXTCAP_PTR          #language eng  "  NextCap Ptr(%2x):    %E%02x%N"

#string STR_PCIEX_CAP_REGISTER         #language eng  "  Cap Register(%2x):   %E%04x%N\n"

#string STR_PCIEX_DEVICE_CAP           #language eng  "  Device Capabilities(%2x):  %E%08x%N\n"

#string STR_PCIEX_DEVICE_CONTROL       #language eng  "  Device Control(%2x):       %E%04x%N"

#string STR_PCIEX_DEVICE_STATUS        #language eng  "       Device Status(%2x):    %E%04x%N\n"

#string STR_PCIEX_LINK_CAPABILITIES    #language eng  "  Link Capabilities(%2x):    %E%08x%N\n"

#string STR_PCIEX_LINK_CONTROL         #language eng  "  Link Control(%2x):         %E%04x%N"

#string STR_PCIEX_LINK_STATUS          #language eng  "       Link Status(%2x):      %E%04x%N\n"

#string STR_PCIEX_SLOT_CAPABILITIES    #language eng  "  Slot Capabilities(%2x):    %E%08x%N\n"

#string STR_PCIEX_SLOT_CONTROL         #language eng  "  Slot Control(%2x):         %E%04x%N"

#string STR_PCIEX_SLOT_STATUS          #language eng  "       Slot Status(%2x):      %E%04x%N\n"

#string STR_PCIEX_ROOT_CONTROL         #language eng  "  Root Control(%2x):         %E%04x%N"

#string STR_PCIEX_RSVDP                #language eng  "       RsvdP(%2x):            %E%04x%N\n"

#string STR_PCIEX_ROOT_STATUS          #language eng  "  Root Status(%2x):          %E%08x%N\n"

#string STR_HELPINFO_PCI_SYNTAX        #language eng  "PCI [Bus Dev [Func] [-s Seg] [-i]]\n"

#string STR_HELPINFO_PCI_LINEHELP      #language eng  "Displays PCI device list or PCI function configuration space"

#string STR_HELPINFO_PCI_VERBOSEHELP   #language eng  "Displays PCI device list or PCI function configuration space.\n"
                                                      "\n"
                                                      "PCI [Bus Dev [Func] [-s Seg] [-i]]\n"
                                                      "\n"
                                                      "    Bus      - Bus number\n"
                                                      "    Dev      - Device number\n"
                                                      "    Func     - Function number\n"
                                                      "    -s       - Optional segment number specified\n"
                                                      "    Seg      - Segment number\n"
                                                      "    -i       - Information interpreted\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. If no parameters are specified all PCI devices will be listed.\n"
                                                      "    2. If the Bus and Device number parameters are specified while the\n"
                                                      "       Function or Segment parameters are not, Function or Segment will\n"
                                                      "       be set as default value 0.\n"
                                                      "    3. The '-i' option can be used to display verbose information for the\n"
                                                      "       specified PCI device. The PCI configuration space for the specified\n"
                                                      "       device will be dumped with a detailed interpretation.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "\n"
                                                      "* To display all PCI devices in the system:\n"
                                                      "Shell> PCI\n"
                                                      "\n"
                                                      "   Seg  Bus  Dev  Func\n"
                                                      "   ---  ---  ---  ----\n"
                                                      "    00   00   00    00 ==> Bridge Device - Host/PCI bridge\n"
                                                      "             Vendor 8086 Device 1130 Prog Interface 0\n"
                                                      "    00   00   01    00 ==> Bridge Device - PCI/PCI bridge\n"
                                                      "             Vendor 8086 Device 1131 Prog Interface 0\n"
                                                      "    00   00   1E    00 ==> Bridge Device - PCI/PCI bridge\n"
                                                      "             Vendor 8086 Device 244E Prog Interface 0\n"
                                                      "    00   00   1F    00 ==> Bridge Device - PCI/ISA bridge\n"
                                                      "             Vendor 8086 Device 2440 Prog Interface 0\n"
                                                      "    00   00   1F    01 ==> Mass Storage Controller - IDE controller\n"
                                                      "             Vendor 8086 Device 244B Prog Interface 80\n"
                                                      "    00   00   1F    02 ==> Serial Bus Controllers - USB\n"
                                                      "             Vendor 8086 Device 2442 Prog Interface 0\n"
                                                      "    00   00   1F    03 ==> Serial Bus Controllers - System Management Bus\n"
                                                      "             Vendor 8086 Device 2443 Prog Interface 0\n"
                                                      "    00   00   1F    04 ==> Serial Bus Controllers - USB\n"
                                                      "             Vendor 8086 Device 2444 Prog Interface 0\n"
                                                      "    00   00   1F    05 ==> Multimedia Device - Audio device\n"
                                                      "             Vendor 8086 Device 2445 Prog Interface 0\n"
                                                      "    00   00   1F    06 ==> Simple Communications Controllers - Modem\n"
                                                      "             Vendor 8086 Device 2446 Prog Interface 0\n"
                                                      "    00   01   00    00 ==> Display Controller - VGA/8514 controller\n"
                                                      "             Vendor 1002 Device 5246 Prog Interface 0\n"
                                                      "    00   02   07    00 ==> Multimedia Device - Audio device\n"
                                                      "             Vendor 1274 Device 1371 Prog Interface 0\n"
                                                      "    00   02   0A    00 ==> Bridge Device - CardBus bridge\n"
                                                      "             Vendor 1180 Device 0476 Prog Interface 0\n"
                                                      "    00   02   0A    01 ==> Bridge Device - CardBus bridge\n"
                                                      "             Vendor 1180 Device 0476 Prog Interface 0\n"
                                                      "\n"
                                                      "* To display the configuration space of Bus 0, Device 0, Function 0:\n"
                                                      "Shell> PCI 00 00 00 -i\n"
                                                      "\n"
                                                      "  PCI Segment 00 Bus 00 Device 00 Func 00\n"
                                                      "  00000000: 86 80 30 11 06 00 90 20-02 00 00 06 00 00 00 00  *..0.... ........*\n"
                                                      "  00000010: 08 00 00 20 00 00 00 00-00 00 00 00 00 00 00 00  *... ............*\n"
                                                      "  00000020: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000030: 00 00 00 00 88 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000040: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000050: 50 00 09 38 00 00 00 00-00 00 00 00 00 00 00 00  *P..8............*\n"
                                                      "  00000060: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000070: 00 00 18 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000080: DE 2C CF 00 00 00 00 00-09 A0 04 F1 00 00 00 00  *.,..............*\n"
                                                      "  00000090: 00 00 D6 FF FE FF 00 00-33 80 33 80 85 84 C4 00  *........3.3.....*\n"
                                                      "  000000A0: 02 00 20 00 07 02 00 1F-00 00 00 00 00 00 00 00  *.. .............*\n"
                                                      "  000000B0: 00 00 00 00 30 00 00 00-00 00 00 00 00 00 08 00  *....0...........*\n"
                                                      "  000000C0: 00 00 00 00 00 00 00 00-00 08 00 00 00 00 00 00  *................*\n"
                                                      "  000000D0: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  000000E0: 00 00 00 00 00 00 00 00-00 00 90 14 00 00 00 00  *................*\n"
                                                      "  000000F0: 00 00 00 00 74 F8 00 00-00 00 00 00 08 00 00 00  *....t...........*\n"
                                                      "\n"
                                                      "Vendor ID(0): 8086                     Device ID(2): 1130\n"
                                                      "\n"
                                                      "Command(4): 0006\n"
                                                      "  (00)I/O space access enabled:       0  (01)Memory space access enabled:    1\n"
                                                      "  (02)Behave as bus master:           1  (03)Monitor special cycle enabled:  0\n"
                                                      "  (04)Mem Write & Invalidate enabled: 0  (05)Palette snooping is enabled:    0\n"
                                                      "  (06)Assert PERR# when parity error: 0  (07)Do address/data stepping:       0\n"
                                                      "  (08)SERR# driver enabled:           0  (09)Fast back-to-back transact...:  0\n"
                                                      "\n"
                                                      "Status(6): 2090\n"
                                                      "  (04)New Capabilities linked list:   1  (05)66MHz Capable:                  0\n"
                                                      "  (07)Fast Back-to-Back Capable:      1  (08)Master Data Parity Error:       0\n"
                                                      "  (09)DEVSEL timing:               Fast  (11)Signaled Target Abort:          0\n"
                                                      "  (12)Received Target Abort:          0  (13)Received Master Abort:          1\n"
                                                      "  (14)Signaled System Error:          0  (15)Detected Parity Error:          0\n"
                                                      "\n"
                                                      "Revision ID(8):     02                 BIST(0F):  Incapable\n"
                                                      "Cache Line Size(C): 00                 Latency Timer(D): 00\n"
                                                      "Header Type(0E):    0, Single function, PCI device\n"
                                                      "Class: Bridge Device - Host/PCI bridge -\n"
                                                      "Base Address Registers(10):\n"
                                                      "     Start  Type    Space     Prefetchable?      Size       Limit\n"
                                                      "  ----------------------------------------------------------------\n"
                                                      "  20000000  Mem     32 bits   YES             04000000    24000000\n"
                                                      "  ----------------------------------------------------------------\n"
                                                      "No Expansion ROM(30)\n"
                                                      "\n"
                                                      "Cardbus CIS ptr(28):   00000000\n"
                                                      "Sub VendorID(2C):          0000      Subsystem ID(2E):      0000\n"
                                                      "Capabilities Ptr(34):        88\n"
                                                      "Interrupt Line(3C):          00      Interrupt Pin(3D):       00\n"
                                                      "Min_Gnt(3E):                 00      Max_Lat(3F):             00\n"
                                                      "\n"
                                                      "* To display configuration space of Segment 0, Bus 0, Device 0, Function 0:\n"
                                                      "Shell> PCI 00 00 00 -s 0\n"
                                                      "\n"
                                                      "  PCI Segment 00 Bus 00 Device 00 Func 00\n"
                                                      "  00000000: 86 80 30 11 06 00 90 20-02 00 00 06 00 00 00 00  *..0.... ........*\n"
                                                      "  00000010: 08 00 00 20 00 00 00 00-00 00 00 00 00 00 00 00  *... ............*\n"
                                                      "  00000020: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000030: 00 00 00 00 88 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000040: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000050: 50 00 09 38 00 00 00 00-00 00 00 00 00 00 00 00  *P..8............*\n"
                                                      "  00000060: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000070: 00 00 18 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  00000080: DE A8 CE 00 00 00 00 00-09 A0 04 F1 00 00 00 00  *................*\n"
                                                      "  00000090: 00 00 D6 FF FE FF 00 00-33 80 33 80 85 84 C4 00  *........3.3.....*\n"
                                                      "  000000A0: 02 00 20 00 07 02 00 1F-00 00 00 00 00 00 00 00  *.. .............*\n"
                                                      "  000000B0: 00 00 00 00 30 00 00 00-00 00 00 00 00 00 08 00  *....0...........*\n"
                                                      "  000000C0: 00 00 00 00 00 00 00 00-00 08 00 00 00 00 00 00  *................*\n"
                                                      "  000000D0: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*\n"
                                                      "  000000E0: 00 00 00 00 00 00 00 00-00 00 A0 18 00 00 00 00  *................*\n"
                                                      "  000000F0: 00 00 00 00 74 F8 00 00-00 00 00 00 08 00 00 00  *....t...........*\n"
